Revit 2027 API
FormatOptions.GetValidSymbols(ForgeTypeId) Method
 Gets the identifiers of all valid symbols for a given unit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ForgeTypeId> GetValidSymbols(
	ForgeTypeId unitTypeId
)
Public Shared Function GetValidSymbols (
	unitTypeId As ForgeTypeId
) As IList(Of ForgeTypeId)
public:
static IList<ForgeTypeId^>^ GetValidSymbols(
	ForgeTypeId^ unitTypeId
)
static member GetValidSymbols :
        unitTypeId : ForgeTypeId -> IList<ForgeTypeId>
Parameters
unitTypeId ForgeTypeId
 Identifier of the unit.
Return Value
IList<ForgeTypeId>
 Identifiers of the valid symbols.
Exceptions
Exception | Condition
ArgumentException |  unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FormatOptions Class
GetValidSymbols Overload
Autodesk.Revit.DB Namespace